test_cases = [
    # Rule 1
    [
    ["அத்தனை", "படங்களா?"],
    ],
    # Rule 2
    [
    ["அவனா", "சொன்னான்"],
    ["அவனா", "கொடுத்தான்"],
    ["அவனே", "சிரித்தான்"],
    ],
    # Rule 3 ; Skipping as Single words 
    [
    # ["செய்", "தவம்"],
    # ["அலை", "கடல்"],
    ],
    # Rule 4
    [
    ["ஒன்று", "கொடு"],
    ["இரண்டு", "பேர்"],
    ],
    # Rule 5
    [
    ["சல", "சல"],
    ["பாம்பு", "பாம்பு"],
    ],
    # Rule 6
    [
    ["கற்க", "கசடற"],
    ["வாழ்க", "தமிழ்"],
    ],
    # Rule 7
    [
    ["சங்கீத", "சபா"],
    ],
    # Rule 8
    [
    ["கற்ற", "சிறுவன்"],
    ["சிறிய", "பெண்"],
    ],
    # Rule 9
    [
    ["வள்ளுவர்", "கருத்து"],
    ],
    # Rule 10
    [
    ["வந்து", "பேனான்"],
    ["செய்து", "கொடுத்தாள்"],
    ],
    # Rule 11
    [
    ["வந்தது", "பறவை"],
    ["சென்றன", "குதிரைகள்"],
    ],
    # Rule 12
    [
    ["சீதை", "சென்றாள்"],
    ["கொக்கு", "பறந்தது"],
    ],
    # Rule 13
    [
    ["வந்து", "பார்த்தான்"],
    ],
    # Rule 14
    [

    ],
    # Rule 15
    [
    ["தாய்", "தந்தை"],
    ["மார்கழி", "தை"],
    ],
    # Rule 16
    [
    ["அவை", "போயின"],
    ["இவை", "செய்தன"],
    ],
    # Rule 17
    [
    ["வரும்படி", "கூறினாள்"],
    ["போகும்படி", "சொன்னான்"],
    ],
    # Rule 18
    [
    ["அது", "போயிற்று"],
    ["இது", "பிறந்தது"],
    ["எது", "கண்டது"],
    ["யாது", "சொல்"],
    ],
    # Rule 19
    [
    ["பல", "குடிசைகள்"],
    ["சில", "சொற்கள்"],
    ],
    # Rule 20
    [
    ["தம்பி", "போ"],
    ],
    # Rule 21
    [
    ["தமிழ்", "கற்றார்"],
    ["துணி", "கட்டினான்"],
    ],
    # Rule 22
    [
    ["அவ்வளவு", "பெரிது"],
    ["இவ்வளவு", "கனிவா"],
    ["எவ்வளவு", "தொலைவு"],
    ],
    # Rule 23
    [
    ["பல", "பசு"],
    ["சில", "கலை"],
    ],
    # Rule 24
    [
    ["வா", "கலையரசி"],
    ["எழு", "தம்பி"],
    ],
    # Rule 25
    [
    ["கோவலனோடு", "கண்ணகி வந்தாள்"],
    ["துணிவோடு", "செல்க"],
    ],
    # Rule 26
    [
    ["காணிய", "சென்றேன்"],
    ["உண்ணிய", "சென்றான்"],
    ],
    # Rule 27
    [
    ["தாய்", "கண்டாள்"],
    ["கண்ணகி", "சீறினள்"],
    ],
    # Rule 28
    [
    ["மரத்திலிருந்து", "பறித்தேன்"],
    ["மலையினின்று", "சரிந்தது"],
    ],
    # Rule 29 Skipping as Single words 
    [
    # ["எழுத்து", "கள்"],
    # ["போற்று", "தல்"],
    ],
    # Rule 30
    [
    ["அன்று", "கொடுத்தேன்"]
    ],
]

from tamilinayavaani import SpellChecker

for rule_num, rules in enumerate(test_cases, 1):
    # print(f'Rule {rule_num}:', rules)
    if rule_num <= 28:continue
    for test_case in rules:
        is_correct, sugges = SpellChecker.REST_interface(test_case[0], test_case[1])
        if not is_correct:
            from c2 import sandhi_checker
            is_correct, sugges = sandhi_checker(test_case[0], test_case[1])
            if is_correct is not True:
                print(rule_num,test_case[0], test_case[1], SpellChecker.REST_interface(test_case[0], test_case[1]))
                # exit()